expense_tracker/jmeter/report/report_20251014_151743/statistics.json
{
  "GET Home" : {
    "transaction" : "GET Home",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.06600000000000011,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 52.493438320209975,
    "receivedKBytesPerSec" : 56.85080380577428,
    "sentKBytesPerSec" : 0.0
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.26000000000000023,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.0,
    "throughput" : 52.55965520866184,
    "receivedKBytesPerSec" : 57.230483943025334,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 0.15150000000000002,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 209.90764063811923,
    "receivedKBytesPerSec" : 228.30530738350126,
    "sentKBytesPerSec" : 0.0
  },
  "GET Expenses" : {
    "transaction" : "GET Expenses",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.04800000000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 52.626039364277446,
    "receivedKBytesPerSec" : 57.456945321545106,
    "sentKBytesPerSec" : 0.0
  },
  "POST Add Expense" : {
    "transaction" : "POST Add Expense",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.23199999999999998,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.0,
    "throughput" : 52.63711969681019,
    "receivedKBytesPerSec" : 57.21202560795873,
    "sentKBytesPerSec" : 0.0
  }
}