expense_tracker/jmeter/report/report_k8s_baseline_20251104_204901/statistics.json
{
  "GET Add Expense Page" : {
    "transaction" : "GET Add Expense Page",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6177.299999999999,
    "medianResTime" : 5941.5,
    "minResTime" : 41.0,
    "maxResTime" : 15950.0,
    "pct1ResTime" : 14166.9,
    "pct2ResTime" : 14614.849999999997,
    "pct3ResTime" : 15950.0,
    "throughput" : 2.0155601241585037,
    "receivedKBytesPerSec" : 7.991380961019067,
    "sentKBytesPerSec" : 0.6928487926794856
  },
  "GET Login Page" : {
    "transaction" : "GET Login Page",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4241.12,
    "medianResTime" : 4701.0,
    "minResTime" : 14.0,
    "maxResTime" : 8647.0,
    "pct1ResTime" : 8579.7,
    "pct2ResTime" : 8620.8,
    "pct3ResTime" : 8647.0,
    "throughput" : 5.424758598242378,
    "receivedKBytesPerSec" : 8.947673117608765,
    "sentKBytesPerSec" : 0.6569043615059129
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8744.04,
    "medianResTime" : 7395.0,
    "minResTime" : 2290.0,
    "maxResTime" : 17316.0,
    "pct1ResTime" : 15091.2,
    "pct2ResTime" : 17082.0,
    "pct3ResTime" : 17316.0,
    "throughput" : 1.894441708028644,
    "receivedKBytesPerSec" : 1.4171311995604894,
    "sentKBytesPerSec" : 0.7122656812412382
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5626.625000000001,
    "medianResTime" : 5246.0,
    "minResTime" : 14.0,
    "maxResTime" : 17316.0,
    "pct1ResTime" : 13201.9,
    "pct2ResTime" : 14975.449999999995,
    "pct3ResTime" : 17200.800000000003,
    "throughput" : 7.32627568775413,
    "receivedKBytesPerSec" : 19.093748282904137,
    "sentKBytesPerSec" : 2.5881642871533757
  },
  "POST Add Expense" : {
    "transaction" : "POST Add Expense",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3344.0399999999995,
    "medianResTime" : 252.5,
    "minResTime" : 40.0,
    "maxResTime" : 15777.0,
    "pct1ResTime" : 13115.999999999998,
    "pct2ResTime" : 14903.149999999998,
    "pct3ResTime" : 15777.0,
    "throughput" : 2.316745436011491,
    "receivedKBytesPerSec" : 9.411778333796683,
    "sentKBytesPerSec" : 1.3257937749050135
  }
}