expense_tracker/jmeter/report/report_k8s_extreamly-high-spike_20251108_174628/statistics.json
{
  "GET Add Expense Page" : {
    "transaction" : "GET Add Expense Page",
    "sampleCount" : 19,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 388122.84210526315,
    "medianResTime" : 387517.0,
    "minResTime" : 381808.0,
    "maxResTime" : 394401.0,
    "pct1ResTime" : 393172.0,
    "pct2ResTime" : 394401.0,
    "pct3ResTime" : 394401.0,
    "throughput" : 0.04804021218603193,
    "receivedKBytesPerSec" : 0.1923954200926923,
    "sentKBytesPerSec" : 0.014168109453302385
  },
  "GET Login Page" : {
    "transaction" : "GET Login Page",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 101403.97200000001,
    "medianResTime" : 101323.0,
    "minResTime" : 100887.0,
    "maxResTime" : 101987.0,
    "pct1ResTime" : 101795.8,
    "pct2ResTime" : 101858.0,
    "pct3ResTime" : 101927.0,
    "throughput" : 4.8209499199722305,
    "receivedKBytesPerSec" : 7.951742592610448,
    "sentKBytesPerSec" : 0.5743709865591916
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 200728.0820000001,
    "medianResTime" : 200591.5,
    "minResTime" : 4366.0,
    "maxResTime" : 397573.0,
    "pct1ResTime" : 358979.30000000005,
    "pct2ResTime" : 378644.2,
    "pct3ResTime" : 394270.12,
    "throughput" : 1.2492067537113933,
    "receivedKBytesPerSec" : 2.4679152956622543,
    "sentKBytesPerSec" : 0.46723260417135115
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1019,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 155486.1246319922,
    "medianResTime" : 101688.0,
    "minResTime" : 4366.0,
    "maxResTime" : 397573.0,
    "pct1ResTime" : 332982.0,
    "pct2ResTime" : 373619.0,
    "pct3ResTime" : 392965.19999999995,
    "throughput" : 2.033059665014016,
    "receivedKBytesPerSec" : 3.7680292358319285,
    "sentKBytesPerSec" : 0.5031484430334288
  }
}